In [1]:
from bs4 import BeautifulSoup
import requests

## Write a python program to display all the header tags from wikipedia.org.

In [13]:
page=requests.get('https://en.wikipedia.org/wiki/Main_Page')
page

In [379]:
soup=BeautifulSoup(page.content)

In [15]:
header=[]
for i in soup.find_all('span',class_="mw-headline"):
    header.append(i.text)
header

["From today's featured article",
 'Did you know\xa0...',
 'In the news',
 'On this day',
 "Today's featured picture",
 'Other areas of Wikipedia',
 "Wikipedia's sister projects",
 'Wikipedia languages']

 ## Write a python program to display IMDB’s Top rated 100 movies’ data (i.e. name, rating, year of release)and make data frame.

In [17]:
page=requests.get('https://www.imdb.com/list/ls055592025/')
page

In [380]:
soup=BeautifulSoup(page.content)

In [91]:
title=[]
for i in soup.find_all('h3',class_="lister-item-header"):
    title.append(i.text.split('\n')[2].replace(',',''))

In [92]:
year=[]
for i in soup.find_all('h3',class_="lister-item-header"):
    year.append(i.text.split('\n')[3].replace('(','').replace(')',''))

In [90]:

rating=[]

for i in soup.find_all('span',class_='ipl-rating-star__rating'):
    rating.append(i.text)

In [62]:
rate=[]
for i in np.arange(0,2300,23):
    rate.append(rating[i])
len(rate)

100

In [66]:
print(len(title),len(year),len(rate))

100 100 100

In [67]:
import pandas as pd
df=pd.DataFrame({'Title':title,
             'Year':year,
             'Rating':rate})
df

                       Title  Year Rating
0              The Godfather  1972    9.2
1   The Shawshank Redemption  1994    9.3
2           Schindler's List  1993    8.9
3                Raging Bull  1980    8.2
4                 Casablanca  1942    8.5
..                       ...   ...    ...
95               Rear Window  1954    8.5
96             The Third Man  1949    8.1
97     Rebel Without a Cause  1955    7.7
98        North by Northwest  1959    8.3
99       Yankee Doodle Dandy  1942    7.7

[100 rows x 3 columns]

## Write a python program to display IMDB’s Top rated 100 Indian movies’ data (i.e. name, rating, year ofrelease) and make data frame.

In [300]:
page=requests.get("https://www.imdb.com/india/top-rated-indian-movies/")
page

In [299]:
soup=BeautifulSoup(page.content)

In [127]:
title=[]
for i in soup.find_all('td',class_='titleColumn'):
    title.append(i.text.split('\n')[2])
len(title)

250

In [99]:
year=[]
for i in soup.find_all('td',class_='titleColumn'):
    year.append(i.text.split('\n')[3].replace('(','').replace(')',''))
len(year)

250

In [123]:
rating=[]
div_mode = soup.find("div",class_="lister")

tbody = div_mode.find("tbody",class_="lister-list")
for i in tbody.find_all('td',class_='ratingColumn imdbRating'):
    rating.append(i.text.split('\n')[1])
len(rating)

250

In [128]:
print(len(title),len(year),len(rating))

250 250 250

In [135]:
df=pd.DataFrame({'Title':title,
               'Year':year,
               'Rating':rating})
df.head(100)

                      Title  Year Rating
0                  Jai Bhim  2021    8.7
1                   Nayakan  1987    8.5
2         Pariyerum Perumal  2018    8.5
3                Anbe Sivam  2003    8.5
4              Sardar Udham  2021    8.5
..                      ...   ...    ...
95                Sarfarosh  1999    8.1
96                    Queen  2013    8.1
97                     Roja  1992    8.1
98           Dil Chahta Hai  2001    8.1
99          OMG: Oh My God!  2012    8.1

[100 rows x 3 columns]

## Write a python program to scrape cricket rankings from icc-cricket.com. You have to scrape:
a) Top 10 ODI teams in men’s cricket along with the records for matches, points and rating.
b) Top 10 ODI Batsmen in men along with the records of their team and rating.
c) Top 10 ODI bowlers along with the records of their team and rating.

In [301]:
page=requests.get("https://www.icc-cricket.com/rankings/mens/team-rankings/odi")
page

In [303]:
soup=BeautifulSoup(page.content)

In [207]:
top=soup.find('tr',class_='rankings-block__banner')
import pandas as pd
top_team=top.text.split('\n')
first=[]
for i in [top_team[1],top_team[4],top_team[7],top_team[8],top_team[10]]:
    first.append(i)

['1', 'New Zealand', '17', '2,054', '                            121']

In [226]:
rank=[]
for i in soup.find_all('tr',class_='table-body'):
    rank.append(i.text.split('\n')[1])

rank.insert(0,first[0])
len(rank)

20

In [216]:
team=[]
for i in soup.find_all('tr',class_='table-body'):
    team.append(i.text.split('\n')[4])
team.insert(0,first[1])
len(team)

20

In [217]:
matches=[]
for i in soup.find_all('tr',class_='table-body'):
    matches.append(i.text.split('\n')[7])
matches.insert(0,first[2])
len(matches)

20

In [218]:
points=[]
for i in soup.find_all('tr',class_='table-body'):
    points.append(i.text.split('\n')[8])
points.insert(0,first[3])
len(points)

20

In [225]:
rating=[]
for i in soup.find_all('tr',class_='table-body'):
    rating.append(i.text.split('\n')[9])
rating.insert(0,first[4].replace('                            ' ,''))
len(rating)

20

In [231]:
Top_odi_teams=pd.DataFrame({'Rank':rank,
             'Team':team,
             'Matches':matches,
             'Points':points,
             'Rating':rating},index=None)
Top_odi_teams.head(10)

  Rank          Team Matches Points Rating
0    1   New Zealand      17  2,054    121
1    2       England      32  3,793    119
2    3     Australia      28  3,244    116
3    4         India      32  3,624    113
4    5  South Africa      25  2,459     98
5    6      Pakistan      27  2,524     93
6    7    Bangladesh      30  2,740     91
7    8   West Indies      30  2,523     84
8    9     Sri Lanka      32  2,657     83
9   10   Afghanistan      17  1,054     62

In [ ]:
#Top 10 ODI Batsmen in men along with the records of their team and rating

In [414]:
page=requests.get("https://www.icc-cricket.com/rankings/mens/player-rankings/odi")
page

In [415]:
soup=BeautifulSoup(page.content)

In [417]:
player=[]
for i in soup.find_all('td',class_='table-body__cell name'):
    player.append(i.text.replace('\n',''))
len(player)

54

In [418]:
country=[]
for i in soup.find_all('td',class_='table-body__cell nationality-logo'):
    country.append(i.text.replace('\n',''))
len(country)

54

In [419]:
rating=[]
for i in soup.find_all('td',class_='table-body__cell u-text-right rating'):
    rating.append(i.text.replace('\n',''))
len(rating)

54

In [420]:
top=[]
for i in soup.find_all('div',class_='rankings-block__banner--player-info'):
    top.append(i.text.replace('\n',''))
top

['Babar AzamPAK                            873',
 'Trent BoultNZ                            737',
 'Shakib Al HasanBAN                            416',
 'Babar AzamPAK                            873',
 'Trent BoultNZ                            737',
 'Shakib Al HasanBAN                            416']

In [421]:
name=[]                                     
for i in range(10):
    name.append(top[0][i])
name=''.join(name)
list(name)
con=[]
for i in range(10,13):
    con.append(top[0][i])
con=''.join(con)
list(con)
rat=[]
for i in range(41,44):
    rat.append(top[0][i])
rat=''.join(rat)
player.insert(0,name)
country.insert(0,con)
rating.insert(0,rat)

In [422]:
name=[]                                     
for i in range(11):
    name.append(top[1][i])
name=''.join(name)
list(name)
con=[]
for i in range(11,13):
    con.append(top[1][i])
con=''.join(con)
list(con)
rat=[]
for i in range(41,44):
    rat.append(top[1][i])
rat=''.join(rat)
player.insert(10,name)
country.insert(10,con)
rating.insert(10,rat)

In [423]:
players=pd.DataFrame({'Player':player,
             'Country':country,
             'Rating':rating,})
Top_odi_batsman=players.iloc[0:10,:]
top_odi_bowler=players.iloc[10:20,:]

In [424]:
#top10_odi_batsman
Top_odi_batsman

            Player Country Rating
0       Babar Azam     PAK    873
1      Virat Kohli     IND    844
2     Rohit Sharma     IND    813
3      Ross Taylor      NZ    801
4      Aaron Finch     AUS    779
5   Jonny Bairstow     ENG    775
6     David Warner     AUS    762
7        Shai Hope      WI    758
8  Kane Williamson      NZ    754
9  Quinton de Kock      SA    747

In [386]:
#top10_odi_bowlers
top_odi_bowler

              Player Country Rating
10       Trent Boult      NZ    737
11    Josh Hazlewood     AUS    709
12  Mujeeb Ur Rahman     AFG    708
13      Chris Woakes     ENG    700
14      Mehedi Hasan     BAN    692
15        Matt Henry      NZ    691
16    Jasprit Bumrah     IND    679
17    Mitchell Starc     AUS    652
18   Shakib Al Hasan     BAN    650
19     Kagiso Rabada      SA    646

## Write a python program to scrape cricket rankings from icc-cricket.com. You have to scrape:
a) Top 10 ODI teams in women’s cricket along with the records for matches, points and rating.
b) Top 10 women’s ODI players along with the records of their team and rating.
c) Top 10 women’s ODI all-rounder along with the records of their team and rating

In [387]:
page=requests.get("https://www.icc-cricket.com/rankings/womens/team-rankings/odi")
page

In [388]:
soup=BeautifulSoup(page.content)

In [391]:
top=soup.find('tr',class_='rankings-block__banner')
import pandas as pd
top_team=top.text.split('\n')
first=[]
for i in [top_team[1],top_team[4],top_team[7],top_team[8],top_team[10]]:
    first.append(i)

['1', 'Australia', '17', '2,746', '                            162']

In [392]:
rank=[]
for i in soup.find_all('tr',class_='table-body'):
    rank.append(i.text.split('\n')[1])

rank.insert(0,first[0])
len(rank)

11

In [393]:
team=[]
for i in soup.find_all('tr',class_='table-body'):
    team.append(i.text.split('\n')[4])
team.insert(0,first[1])
len(team)

11

In [394]:
matches=[]
for i in soup.find_all('tr',class_='table-body'):
    matches.append(i.text.split('\n')[7])
matches.insert(0,first[2])
len(matches)

11

In [395]:
points=[]
for i in soup.find_all('tr',class_='table-body'):
    points.append(i.text.split('\n')[8])
points.insert(0,first[3])
len(points)

11

In [396]:
rating=[]
for i in soup.find_all('tr',class_='table-body'):
    rating.append(i.text.split('\n')[9])
rating.insert(0,first[4].replace('                            ' ,''))
len(rating)

11

In [397]:
Top_odi_teams=pd.DataFrame({'Rank':rank,
             'Team':team,
             'Matches':matches,
             'Points':points,
             'Rating':rating},index=None)
Top_odi_teams.head(10)

  Rank          Team Matches Points Rating
0    1     Australia      17  2,746    162
1    2  South Africa      19  2,307    121
2    3       England      18  2,148    119
3    4         India      17  1,899    112
4    5    Bangladesh       5    475     95
5    6   New Zealand      19  1,668     88
6    7   West Indies      19  1,658     87
7    8      Pakistan      18  1,226     68
8    9       Ireland       5    240     48
9   10     Sri Lanka       5    233     47

In [446]:
page=requests.get("https://www.icc-cricket.com/rankings/womens/player-rankings/odi")
page

In [447]:
soup=BeautifulSoup(page.content)

In [448]:
player=[]
for i in soup.find_all('td',class_='table-body__cell name'):
    player.append(i.text.replace('\n',''))
len(player)

27

In [449]:
country=[]
for i in soup.find_all('td',class_='table-body__cell nationality-logo'):
    country.append(i.text.replace('\n',''))
len(country)

27

In [450]:
rating=[]
for i in soup.find_all('td',class_='table-body__cell u-text-right rating'):
    rating.append(i.text.replace('\n',''))
len(rating)

27

In [451]:
top=[]
for i in soup.find_all('div',class_='rankings-block__banner--player-info'):
    top.append(i.text.replace('\n',''))
top

['Lizelle LeeSA                            761',
 'Jess JonassenAUS                            760',
 'Marizanne KappSA                            384']

In [452]:
name=[]                                     
for i in range(11):
    name.append(top[0][i])
name=''.join(name)
list(name)
con=[]
for i in range(11,13):
    con.append(top[0][i])
con=''.join(con)
list(con)
rat=[]
for i in range(41,44):
    rat.append(top[0][i])
rat=''.join(rat)
player.insert(0,name)
country.insert(0,con)
rating.insert(0,rat)

In [453]:
name=[]                                     
for i in range(13):
    name.append(top[1][i])
name=''.join(name)
list(name)
con=[]
for i in range(13,16):
    con.append(top[1][i])
con=''.join(con)
list(con)
rat=[]
for i in range(44,47):
    rat.append(top[1][i])
rat=''.join(rat)
player.insert(10,name)
country.insert(10,con)
rating.insert(10,rat)

In [454]:
name=[]                                     
for i in range(14):
    name.append(top[2][i])
name=''.join(name)
list(name)
con=[]
for i in range(14,16):
    con.append(top[2][i])
con=''.join(con)
list(con)
rat=[]
for i in range(44,47):
    rat.append(top[2][i])
rat=''.join(rat)
player.insert(20,name)
country.insert(20,con)
rating.insert(20,rat)

In [455]:
print(len(player),len(country),len(rating))

30 30 30

In [456]:
players=pd.DataFrame({'Player':player,
             'Country':country,
             'Rating':rating,})
Top_odi_batsman=players.iloc[0:10,:]
top_odi_all=players.iloc[20:30,:]

In [457]:
Top_odi_batsman #top 10 women batsmen_odi

              Player Country Rating
0        Lizelle Lee      SA    761
1       Alyssa Healy     AUS    750
2        Mithali Raj     IND    738
3     Tammy Beaumont     ENG    728
4  Amy Satterthwaite      NZ    717
5    Smriti Mandhana     IND    710
6        Meg Lanning     AUS    699
7        Beth Mooney     AUS    690
8     Heather Knight     ENG    674
9    Laura Wolvaardt      SA    672

In [459]:
#top 10 women all rounder
top_odi_all

              Player Country Rating
20    Marizanne Kapp      SA    384
21    Natalie Sciver     ENG    372
22      Ellyse Perry     AUS    365
23   Stafanie Taylor      WI    314
24     Deepti Sharma     IND    299
25  Ashleigh Gardner     AUS    275
26  Dane van Niekerk      SA    274
27     Jess Jonassen     AUS    272
28   Katherine Brunt     ENG    272
29   Hayley Matthews      WI    271

## Write a python program to scrape details of all the posts from coreyms.com. Scrape the heading, date, contentand the code for the video from the link for the youtube video from the post

In [460]:
page=requests.get("https://coreyms.com/")
page

In [461]:
soup=BeautifulSoup(page.content)

In [468]:
heading=[]
for i in soup.find_all('h2',class_='entry-title'):
    heading.append(i.text)
len(heading)

10

In [503]:
date=[]
for i in soup.find_all('p',class_='entry-meta'):
    date.append(i.text)

In [502]:
dat=[]
for i in range(0,20,2):
    dat.append(date[i])
len(dat)

10

In [485]:
link=[]
for i in soup.find_all('div',class_='entry-content'):
    link.append(i.text.replace('\n',''))
len(link)

10

In [505]:
content=pd.DataFrame({'Heading':heading,
             'Date':dat,
             'Link':link})
content

,Heading,Date,Link
0,Python Tutorial: Zip Files – Creating and Extr...,"November 19, 2019 by Corey Schafer Leave a Com...","In this video, we will be learning how to crea..."
1,Python Data Science Tutorial: Analyzing the 20...,"October 17, 2019 by Corey Schafer Leave a Comm...","In this Python Programming video, we will be l..."
2,Python Multiprocessing Tutorial: Run Code in P...,"September 21, 2019 by Corey Schafer Leave a Co...","In this Python Programming video, we will be l..."
3,Python Threading Tutorial: Run Code Concurrent...,"September 12, 2019 by Corey Schafer Leave a Co...","In this Python Programming video, we will be l..."
4,Update (2019-09-03),"September 3, 2019 by Corey Schafer Leave a Com...",Hey everyone. I wanted to give you an update o...
5,Python Quick Tip: The Difference Between “==” ...,"August 6, 2019 by Corey Schafer Leave a Comment","In this Python Programming Tutorial, we will b..."
6,Python Tutorial: Calling External Commands Usi...,"July 24, 2019 by Corey Schafer Leave a Comment","In this Python Programming Tutorial, we will b..."
7,Visual Studio Code (Windows) – Setting up a Py...,"May 1, 2019 by Corey Schafer Leave a Comment","In this Python Programming Tutorial, we will b..."
8,Visual Studio Code (Mac) – Setting up a Python...,"May 1, 2019 by Corey Schafer Leave a Comment","In this Python Programming Tutorial, we will b..."
9,Clarifying the Issues with Mutable Default Arg...,"April 24, 2019 by Corey Schafer Leave a Comment","In this Python Programming Tutorial, we will b..."

## Write a python program to scrape house details from mentioned URL. It should include house title, location,area, EMI and price from nobroker.in.

In [506]:
page=requests.get("https://www.nobroker.in/property/sale/bangalore/Electronic%20City?type=BHK4&searchParam=W3sibGF0IjoxMi44N%20DUyMTQ1LCJsb24iOjc3LjY2MDE2OTUsInBsYWNlSWQiOiJDaElKdy1GUWQ0cHNyanNSSGZkYXpnXzhYRW8%20iLCJwbGFjZU5hbWUiOiJFbGVjdHJvbmljIENpdHkifV0=&propertyAge=0&radius=2.0")
page

In [507]:
soup=BeautifulSoup(page.content)

In [510]:
name=[]
for i in soup.find_all('a',class_='nb__U5JyW'):
    name.append(i.text)
len(name)

16

In [516]:
location=[]
for i in soup.find_all('div',class_='nb__1EwQz'):
    location.append(i.text.replace(',',''))
len(location)

16

In [520]:
rate=[]
for i in soup.find_all('div',class_='font-semi-bold heading-6'):
    rate.append(i.text)
rate

['1,800 sqft',
 '₹77,374/Month',
 '₹1.35 Crores',
 '2,000 sqft',
 '₹39,546/Month',
 '₹69 Lacs',
 '1,120 sqft',
 '₹28,657/Month',
 '₹50 Lacs',
 '2,000 sqft',
 '₹45,851/Month',
 '₹80 Lacs',
 '1,879 sqft',
 '₹91,703/Month',
 '₹1.6 Crores',
 '2,600 sqft',
 '₹85,971/Month',
 '₹1.5 Crores',
 '2,000 sqft',
 '₹39,546/Month',
 '₹69 Lacs',
 '3,000 sqft',
 '₹71,643/Month',
 '₹1.25 Crores',
 '3,000 sqft',
 '₹1.43 Lacs/Month',
 '₹2.5 Crores',
 '1,200 sqft',
 '₹42,985/Month',
 '₹75 Lacs',
 '2,650 sqft',
 '₹68,777/Month',
 '₹1.2 Crores',
 '3,100 sqft',
 '₹85,971/Month',
 '₹1.5 Crores',
 '1,100 sqft',
 '₹40,120/Month',
 '₹70 Lacs',
 '2,350 sqft',
 '₹71,643/Month',
 '₹1.25 Crores',
 '3,000 sqft',
 '₹85,971/Month',
 '₹1.5 Crores',
 '1,500 sqft',
 '₹57,314/Month',
 '₹1 Crore']

In [522]:
emi=[]
for i in range(1,48,3):
    emi.append(rate[i])
len(emi)

16

In [524]:
price=[]
for i in range(2,48,3):
    price.append(rate[i])
len(price)

16

In [526]:
no_broker=pd.DataFrame({'Property_NAME':name,
             'EMI':emi,
             'Price':price})
no_broker

,Property_NAME,EMI,Price
0,4 BHK In Independent House For Sale In Hebba...,"₹77,374/Month",₹1.35 Crores
1,4 BHK In Independent House For Sale In Elect...,"₹39,546/Month",₹69 Lacs
2,4 BHK Flat For Sale In Electronic City,"₹28,657/Month",₹50 Lacs
3,4 BHK Apartment For Sale In Nisarga Residenc...,"₹45,851/Month",₹80 Lacs
4,4 BHK Flat For Sale In Sobha Silicon Oasis ...,"₹91,703/Month",₹1.6 Crores
5,4 BHK For Sale In Daadys Garden In Electronic...,"₹85,971/Month",₹1.5 Crores
6,"4 BHK Flat For Sale In , Electronic City","₹39,546/Month",₹69 Lacs
7,"4 BHK Flat For Sale In Hosa Road, Parappana ...","₹71,643/Month",₹1.25 Crores
8,4 BHK In Independent House For Sale In Elect...,₹1.43 Lacs/Month,₹2.5 Crores
9,4 BHK In Independent House For Sale In Elect...,"₹42,985/Month",₹75 Lacs
10,4 BHK Apartment For Sale In Gopalan Gardenia...,"₹68,777/Month",₹1.2 Crores
11,4 BHK For Sale In Gpr Royale In Gpr Royale,"₹85,971/Month",₹1.5 Crores
12,4 BHK In Independent House For Sale In Sarja...,"₹40,120/Month",₹70 Lacs
13,4 BHK Flat For Sale In Heena Enclave In Elec...,"₹71,643/Month",₹1.25 Crores
14,4 BHK For Sale In Deccan Palms Park In Electr...,"₹85,971/Month",₹1.5 Crores
15,4 BHK In Independent House For Sale In Elect...,"₹57,314/Month",₹1 Crore

## Write a python program to scrape mentioned details from dineout.co.in :
i) Restaurant name
ii) Cuisine
iii) Location
iv) Ratings
v) Image URL

In [527]:
page=requests.get("https://www.dineout.co.in/delhi-restaurants/buffet-special")
page

In [528]:
soup=BeautifulSoup(page.content)

In [542]:
location=[]
for i in soup.find_all('div',class_='restnt-info cursor'):
    location.append(i.text.split(',')[1])
len(location)

13

In [546]:
cuisine=[]
for i in soup.find_all('div',class_='detail-info'):
    cuisine.append(i.text.split('|')[1])
len(cuisine)

13

In [551]:
rating=[]
for i in soup.find_all('div',class_='restnt-rating-widget pull-right text-right'):
    rating.append(i.text.split(' ')[0])
len(rating)

13

In [554]:
name=[]
for i in soup.find_all('a',class_='restnt-name ellipsis'):
    name.append(i.text)
name

['Castle Barbeque',
 'Jungle Jamboree',
 'Castle Barbeque',
 'Cafe Knosh',
 'The Barbeque Company',
 'India Grill',
 'Delhi Barbeque',
 'The Monarch - Bar Be Que Village',
 'World Cafe',
 'Indian Grill Room',
 'Mad 4 Bar B Que',
 'Barbeque 29',
 'Glasshouse']

In [556]:
images=[]
for i in soup.find_all('img',class_='no-img'):
    images.append(i['data-src'])
images

['https://im1.dineout.co.in/images/uploads/restaurant/sharpen/8/k/b/p86792-16062953735fbe1f4d3fb7e.jpg?tr=tr:n-medium',
 'https://im1.dineout.co.in/images/uploads/restaurant/sharpen/5/a/k/p59633-16046474755fa4fa33c0e92.jpg?tr=tr:n-medium',
 'https://im1.dineout.co.in/images/uploads/restaurant/sharpen/3/j/o/p38113-15959192065f1fcb666130c.jpg?tr=tr:n-medium',
 'https://im1.dineout.co.in/images/uploads/restaurant/sharpen/4/j/v/p406-163401663361651d79326d0.jpg?tr=tr:n-medium',
 'https://im1.dineout.co.in/images/uploads/restaurant/sharpen/7/q/d/p79307-16051787075fad15532bd7c.jpg?tr=tr:n-medium',
 'https://im1.dineout.co.in/images/uploads/restaurant/sharpen/2/v/t/p2687-1482477169585cce712b90f.jpg?tr=tr:n-medium',
 'https://im1.dineout.co.in/images/uploads/restaurant/sharpen/5/v/f/p52501-16006856545f68865616659.jpg?tr=tr:n-medium',
 'https://im1.dineout.co.in/images/uploads/restaurant/sharpen/3/n/o/p34822-15599107305cfa594a13c24.jpg?tr=tr:n-medium',
 'https://im1.dineout.co.in/images/uploads/restaurant/sharpen/1/p/y/p12366-1466935020576fa6ecdc359.jpg?tr=tr:n-medium',
 'https://im1.dineout.co.in/images/uploads/restaurant/sharpen/5/y/y/p549-15143767525a438e30b3e19.jpg?tr=tr:n-medium',
 'https://im1.dineout.co.in/images/uploads/restaurant/sharpen/4/j/e/p43488-15295778165b2b8158ceeef.jpg?tr=tr:n-medium',
 'https://im1.dineout.co.in/images/uploads/restaurant/sharpen/5/w/r/p58842-15624171585d209806d9143.jpg?tr=tr:n-medium',
 'https://im1.dineout.co.in/images/uploads/restaurant/sharpen/9/m/f/p9875-16057921085fb6716cc44f8.jpg?tr=tr:n-medium']

In [557]:
dine_out=pd.DataFrame({'Name':name,
             'Location':location,
             'Cuisine':cuisine,
             'Rating':rating,
             'Image_URL':images})
dine_out

,Name,Location,Cuisine,Rating,Image_URL
0,Castle Barbeque,Central Delhi,"Chinese, North Indian1 offer available",4.3232,https://im1.dineout.co.in/images/uploads/resta...
1,Jungle Jamboree,Lajpat Nagar - 3,"North Indian, Barbecue, Italian, Asian",4.3232,https://im1.dineout.co.in/images/uploads/resta...
2,Castle Barbeque,Tagore Garden,"North Indian, Chinese1 offer available",4.3232,https://im1.dineout.co.in/images/uploads/resta...
3,Cafe Knosh,Shahdara,"Multi-Cuisine, North Indian, Italian, Contine...",4.3232,https://im1.dineout.co.in/images/uploads/resta...
4,The Barbeque Company,Sector 38A,"Barbecue, Chinese, Mughlai, North Indian",4.3232,https://im1.dineout.co.in/images/uploads/resta...
5,India Grill,Saket,"North Indian, Italian, Oriental 1 offer avail...",4.3232,https://im1.dineout.co.in/images/uploads/resta...
6,Delhi Barbeque,Mahipalpur,"Barbecue, North Indian",4.3232,https://im1.dineout.co.in/images/uploads/resta...
7,The Monarch - Bar Be Que Village,Indirapuram,"North Indian, Chinese, Fast Food1 offer avail...",4.3232,https://im1.dineout.co.in/images/uploads/resta...
8,World Cafe,Sector 35,"North Indian, Chinese, Continental1 offer ava...",4.3232,https://im1.dineout.co.in/images/uploads/resta...
9,Indian Grill Room,Golf Course Road,"North Indian, Mughlai, Barbecue2 deals available",4.3232,https://im1.dineout.co.in/images/uploads/resta...
10,Mad 4 Bar B Que,Faridabad,"North Indian, Mughlai",4.3232,https://im1.dineout.co.in/images/uploads/resta...
11,Barbeque 29,Faridabad,"North Indian, Chinese, Barbecue1 deal available",4.3232,https://im1.dineout.co.in/images/uploads/resta...
12,Glasshouse,Sector 50,"Multi-Cuisine, Asian, European, Italian, Nort...",4.3232,https://im1.dineout.co.in/images/uploads/resta...

## Write a python program to scrape weather details for last 24 hours from Tutiempo.net :
i) Hour
ii) Temperature
iii) Wind
iv) Weather condition
v) Humidity
vi) Pressure

In [719]:
page=requests.get("https://en.tutiempo.net/mumbai.html?data=hourly")
page

In [720]:
soup=BeautifulSoup(page.content)

In [734]:
conditions=[]
for i in list.find_all('span',class_='mash'):
    conditions.append(i['data-weather'].split('|'))

In [723]:
weather=[]
for i in range(0,82):
    weather.append(conditions[i][1])
len(weather)

82

In [724]:
hour=[]
for i in range(0,82):
    hour.append(conditions[i][11])
len(hour)

82

In [744]:
temp=[]
for i in range(0,82):
    temp.append(conditions[i][3])
len(temp)

82

In [743]:
humidity=[]
for i in range(0,82):
    humidity.append(conditions[i][7])
len(humidity)

82

In [746]:
wind_speed=[]
for i in range(0,82):
    wind_speed.append(conditions[i][4])
len(wind_speed)

82

In [739]:
pressure=[]
for i in range(0,82):
    pressure.append(conditions[i][10])
len(pressure)

82

In [747]:
weather_rep=pd.DataFrame({'Hour':hour,
              'Weather':weather,
              'Temperature':temp,
             'Wind_speed':wind_speed,
             'Humidity':humidity,
             'Pressure':pressure,
             })
weather_rep

     Hour                   Weather Temperature Wind_speed Humidity Pressure
0   14:00  Cloudy with rain showers          23         14       77     1010
1   15:00  Cloudy with rain showers          23         18       78     1009
2   16:00  Cloudy with rain showers          23         17       79     1010
3   17:00             Mostly cloudy          23         17       79     1010
4   18:00             Mostly cloudy          23         15       77     1011
..    ...                       ...         ...        ...      ...      ...
77  19:00                     Clear          26         14       70     1012
78  20:00                     Clear          26         14       69     1013
79  21:00                     Clear          26         11       68     1013
80  22:00                     Clear          26         12       67     1013
81  23:00                     Clear          26         11       66     1013

[82 rows x 6 columns]

## Write a python program to scrape monument name, monument description, image URL about top 10 monuments from puredestinations.co.uk

In [590]:
page=requests.get("https://www.puredestinations.co.uk/top-10-famous-monuments-to-visit-in-india/")
page

In [632]:
soup=BeautifulSoup(page.content)

In [652]:

info=soup.find('div',class_='blog--single__content column--3-4 u-spacing-third')

In [642]:
des=[]
for i in info.find_all('p'):
    des.append(i.text.replace(',',''))
des

['Rich in culture and diversity India is home to some of the finest historical monuments in the world. Most recognised by the UNESCO World Heritage Site the famous Indian monuments include the beautiful Taj Mahal the sacred Golden Temple and the cultural site Hawa Mahal. Discover and experience the magnificent insights into India’s rich heritage and ancient architecture. Read on for our list of the top must see historical monuments in India below.',
 'Taj Mahal Agra',
 'Enlisted in the Seven Wonders of the World The Taj Mahal is one of the most beautiful and famous buildings located in the city of Agra. This white marble monument was built by a Mughal Emperor called Shahajahan in memory of his beloved wife. Due to its amazing architecture and the history behind it this world heritage site has become very popular to visit by all travellers and romantics from all over the world.',
 '',
 'Golden Temple (Harmandir Sahib) Amritsar ',
 'The holiest shrine and pilgrimage place located in Amritsar is The Golden Temple known as the Harmandir Sahib. This is the most famous and sacred Sikh Gurdwara in Punjab India adorned with rich history and gold gilded exterior. If you are interested in culture and history be sure to visit this popular attraction in India.',
 '',
 'Meenakshi Temple Madurai',
 'Meenakshi Temple is situated on the Southern banks of Vaigai River in the temple city Madurai. This temple is dedicated to Parvati and her consort Shiva and is visited by most Hindu and Tamil devotees and architectural lovers throughout the world. It is believed that this shrine houses 33000 sculptures in its 14 gopurams. It’s no doubt one place to visit if you are impressed with art and cultural history.',
 '',
 'Mysore Palace Mysore',
 'The Mysore Palace is a famous historical monument in the city of Mysore in Karnataka. Commonly described as the City of Palaces this is the most famous tourist attraction in India after the Taj Mahal. It is a sight not be missed with its spacious halls lovely art paintings and Indo-Saracenic style architecture. Best time to visit is at night due to the astonishing illuminated lights covering the whole monument.',
 '',
 'Gateway of India Mumbai',
 'Even though Mumbai is famous for its Bollywood actors and movies the most famous attraction in Mumbai is The Gateway of India. It is a popular gathering spot for locals travellers street vendors and photographers and is known as the Taj Mahal of Mumbai. The majestic monument was built to commemorate the visit of King George V and Queen Mary to Bombay. With so much fun and excitement this place is not to be missed with family or on your tour of India.',
 '',
 'Red Fort New Delhi',
 'Declared as the UNESCO’s World Heritage Site Red Fort is located in the centre of beautiful Delhi. If you love learning about history and culture then this famous historic monument is a must see place to visit. Built by the Mughal Emperor Shah Jahan in 1648 and housing a number of museums its walls are built of red sandstone. The best time to visit is on Independence Day where the Prime Minister of India hoists the national flag at the Red Fort. End the day by heading to an Indian restaurant and enjoy the varieties of wonderful cuisines.',
 '',
 'Hawa Mahal Jaipur',
 'Explore a blend of beauty and Rajasthan culture the Hawa Mahal also known as Palace of Winds is situated in the capital of Rajasthan Jaipur. Built from red and pink sandstones by the Maharaja Sawi Pratap Singh in 1799 this unique five storey structure is one of the most prominent tourist attractions in the Jaipur city.',
 '',
 'Qutub Minar New Delhi',
 'Discover one of the tallest towers in the world and the second tallest Minar of India standing elegantly in the Capital city New Delhi. Standing at 72.5 metres and consisting of around 379 stairs this famous monument represents the rich architecture of India. As it is a UNESCO World Heritage Site made of red sandstone and decorated with Arabic and Brahmi inscriptions travellers from around the world come to view this most famous tower in India.',
 '',
 'Sanchi Stupa Sanchi',
 'The beautiful and massive dome Sanchi Stupa also known as the Great Stupa is a world renowned Buddhist monument in Sanchi India. It was constructed by Emperor Ashoka and is one of the oldest stone structures in the heart of India. Experience the Indian culture by visiting these major attractions in Sanchi including a number of Buddhist Stupas monasteries and temples.',
 '',
 'Charminar Hyderabad',
 'No visit to Hyderabad should be complete without visiting the most famous and majestic monument known as the Charminar. This magnificent and striking mosque constructed in 1591 has four minarets and is the most recognisable symbol in the city of Hyderabad.',
 '',
 'Things to know before planning your trip to India',
 'Are you inspired to plan an incredible trip to India? Get in touch with Pure Destinations today to speak to a travel expert to plan a tailor made itinerary.\xa0Fancy exploring these famous monuments in India? Why not\xa0contact\xa0us today!']

In [648]:
name=[]
for i in range(1,31,3):
    name.append(des[i])
len(name)

10

In [651]:
description=[]
for i in range(2,32,3):
    description.append(des[i])
    
len(description)

10

In [662]:
image_url=[]
for i in info.find_all('img'):
    image_url.append(i['src'])
len(image_url)

20

In [664]:
url=[]
for i in range(1,20,2):
    url.append(image_url[i])
len(url)

10

In [665]:
monuments=pd.DataFrame({'Name':name,
             'Description':description,
             'Image_url':url})
monuments

,Name,Description,Image_url
0,Taj Mahal Agra,Enlisted in the Seven Wonders of the World The...,http://www.puredestinations.co.uk/wp-content/u...
1,Golden Temple (Harmandir Sahib) Amritsar,The holiest shrine and pilgrimage place locate...,http://www.puredestinations.co.uk/wp-content/u...
2,Meenakshi Temple Madurai,Meenakshi Temple is situated on the Southern b...,http://www.puredestinations.co.uk/wp-content/u...
3,Mysore Palace Mysore,The Mysore Palace is a famous historical monum...,http://www.puredestinations.co.uk/wp-content/u...
4,Gateway of India Mumbai,Even though Mumbai is famous for its Bollywood...,http://www.puredestinations.co.uk/wp-content/u...
5,Red Fort New Delhi,Declared as the UNESCO’s World Heritage Site R...,http://www.puredestinations.co.uk/wp-content/u...
6,Hawa Mahal Jaipur,Explore a blend of beauty and Rajasthan cultur...,http://www.puredestinations.co.uk/wp-content/u...
7,Qutub Minar New Delhi,Discover one of the tallest towers in the worl...,http://www.puredestinations.co.uk/wp-content/u...
8,Sanchi Stupa Sanchi,The beautiful and massive dome Sanchi Stupa al...,http://www.puredestinations.co.uk/wp-content/u...
9,Charminar Hyderabad,No visit to Hyderabad should be complete witho...,http://www.puredestinations.co.uk/wp-content/u...